{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v3.9.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "32"}, {"size": "1"}]}}}, "outputs": {"time_distributed_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "12"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/dropout_2/dropout/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dropout_1/dropout/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "800"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "800"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}, {"size": "800"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dropout/dropout/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization/batchnorm/Rsqrt", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization/batchnorm/mul_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/conv1d/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/conv1d/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d_1/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/conv1d_1/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/conv1d_1/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/max_pooling1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dropout/dropout/GreaterEqual/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/repeat_vector/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/repeat_vector/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "800"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "800"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}, {"size": "800"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dropout_1/dropout/GreaterEqual/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/time_distributed/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/time_distributed/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/time_distributed/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/time_distributed/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dropout_2/dropout/GreaterEqual/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/time_distributed_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/time_distributed_1/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/time_distributed_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/time_distributed_1/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "32"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization/batchnorm/mul", "op": "Mul", "input": ["input_1", "StatefulPartitionedCall/model/batch_normalization/batchnorm/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization/batchnorm/mul", "StatefulPartitionedCall/model/batch_normalization/batchnorm/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model/batch_normalization/batchnorm/add_1", "StatefulPartitionedCall/model/conv1d/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/conv1d/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/conv1d/Pad", "StatefulPartitionedCall/model/conv1d/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/conv1d/conv1d/ExpandDims", "StatefulPartitionedCall/model/conv1d/conv1d/ExpandDims_1", "StatefulPartitionedCall/model/conv1d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/conv1d/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/conv1d/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/conv1d/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d_1/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model/conv1d/Relu", "StatefulPartitionedCall/model/conv1d_1/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/conv1d_1/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/conv1d_1/Pad", "StatefulPartitionedCall/model/conv1d_1/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d_1/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/conv1d_1/conv1d/ExpandDims", "StatefulPartitionedCall/model/conv1d_1/conv1d/ExpandDims_1", "StatefulPartitionedCall/model/conv1d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/conv1d_1/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/conv1d_1/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/conv1d_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/max_pooling1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/conv1d_1/Relu", "StatefulPartitionedCall/model/max_pooling1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/max_pooling1d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model/max_pooling1d/ExpandDims"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "1", "1"]}}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/model/max_pooling1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/max_pooling1d/MaxPool"], "attr": {"squeeze_dims": {"list": {"i": ["2"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dropout/dropout/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/dropout/dropout/Const", "StatefulPartitionedCall/model/max_pooling1d/Squeeze"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dropout/dropout/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/max_pooling1d/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dropout/dropout/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["StatefulPartitionedCall/model/dropout/dropout/Shape"], "attr": {"seed": {"i": "0"}, "T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/dropout/dropout/GreaterEqual", "op": "GreaterEqual", "input": ["StatefulPartitionedCall/model/dropout/dropout/random_uniform/RandomUniform", "StatefulPartitionedCall/model/dropout/dropout/GreaterEqual/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dropout/dropout/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/model/dropout/dropout/GreaterEqual"], "attr": {"SrcT": {"type": "DT_BOOL"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dropout/dropout/Mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/dropout/dropout/Mul", "StatefulPartitionedCall/model/dropout/dropout/Cast"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/dropout/dropout/Mul_1", "StatefulPartitionedCall/model/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/repeat_vector/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/flatten/Reshape", "StatefulPartitionedCall/model/repeat_vector/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/repeat_vector/Tile", "op": "Tile", "input": ["StatefulPartitionedCall/model/repeat_vector/ExpandDims", "StatefulPartitionedCall/model/repeat_vector/stack"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/repeat_vector/Tile"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/model/repeat_vector/Tile", "StatefulPartitionedCall/model/bidirectional/forward_lstm/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/repeat_vector/Tile"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/model/repeat_vector/Tile", "StatefulPartitionedCall/model/bidirectional/backward_lstm/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/bidirectional/forward_lstm/Shape", "StatefulPartitionedCall/model/bidirectional/forward_lstm/strided_slice/stack", "StatefulPartitionedCall/model/bidirectional/forward_lstm/strided_slice/stack_1", "StatefulPartitionedCall/model/bidirectional/forward_lstm/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/model/bidirectional/forward_lstm/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/model/bidirectional/forward_lstm/transpose", "StatefulPartitionedCall/model/bidirectional/forward_lstm/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/bidirectional/backward_lstm/Shape", "StatefulPartitionedCall/model/bidirectional/backward_lstm/strided_slice/stack", "StatefulPartitionedCall/model/bidirectional/backward_lstm/strided_slice/stack_1", "StatefulPartitionedCall/model/bidirectional/backward_lstm/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/model/bidirectional/backward_lstm/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/ReverseV2", "op": "ReverseV2", "input": ["StatefulPartitionedCall/model/bidirectional/backward_lstm/transpose", "StatefulPartitionedCall/model/bidirectional/backward_lstm/ReverseV2/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/model/bidirectional/forward_lstm/strided_slice", "StatefulPartitionedCall/model/bidirectional/forward_lstm/zeros/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/model/bidirectional/forward_lstm/strided_slice", "StatefulPartitionedCall/model/bidirectional/forward_lstm/zeros_1/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/bidirectional/forward_lstm/Shape_1", "StatefulPartitionedCall/model/bidirectional/forward_lstm/strided_slice_1/stack", "StatefulPartitionedCall/model/bidirectional/forward_lstm/strided_slice_1/stack_1", "StatefulPartitionedCall/model/bidirectional/forward_lstm/strided_slice_1/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/model/bidirectional/backward_lstm/strided_slice", "StatefulPartitionedCall/model/bidirectional/backward_lstm/zeros/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/model/bidirectional/backward_lstm/strided_slice", "StatefulPartitionedCall/model/bidirectional/backward_lstm/zeros_1/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/bidirectional/backward_lstm/Shape_1", "StatefulPartitionedCall/model/bidirectional/backward_lstm/strided_slice_1/stack", "StatefulPartitionedCall/model/bidirectional/backward_lstm/strided_slice_1/stack_1", "StatefulPartitionedCall/model/bidirectional/backward_lstm/strided_slice_1/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/model/bidirectional/backward_lstm/ReverseV2", "StatefulPartitionedCall/model/bidirectional/backward_lstm/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/model/bidirectional/forward_lstm/zeros/packed", "StatefulPartitionedCall/model/bidirectional/forward_lstm/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/model/bidirectional/forward_lstm/zeros_1/packed", "StatefulPartitionedCall/model/bidirectional/forward_lstm/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/model/bidirectional/forward_lstm/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/model/bidirectional/forward_lstm/strided_slice_1"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/model/bidirectional/backward_lstm/zeros/packed", "StatefulPartitionedCall/model/bidirectional/backward_lstm/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/model/bidirectional/backward_lstm/zeros_1/packed", "StatefulPartitionedCall/model/bidirectional/backward_lstm/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/model/bidirectional/backward_lstm/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/model/bidirectional/backward_lstm/strided_slice_1"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/while", "op": "While", "input": ["StatefulPartitionedCall/model/bidirectional/forward_lstm/while/loop_counter", "StatefulPartitionedCall/model/bidirectional/forward_lstm/while/maximum_iterations", "StatefulPartitionedCall/model/bidirectional/forward_lstm/time", "StatefulPartitionedCall/model/bidirectional/forward_lstm/TensorArrayV2_1", "StatefulPartitionedCall/model/bidirectional/forward_lstm/zeros", "StatefulPartitionedCall/model/bidirectional/forward_lstm/zeros_1", "StatefulPartitionedCall/model/bidirectional/forward_lstm/strided_slice_1", "StatefulPartitionedCall/model/bidirectional/forward_lstm/TensorArrayUnstack/TensorListFromTensor", "unknown_5", "unknown_6", "unknown_7"], "attr": {"T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "200"}]}, {"dim": [{"size": "-1"}, {"size": "200"}]}, {}, {}, {"dim": [{"size": "1024"}, {"size": "800"}]}, {"dim": [{"size": "800"}]}, {"dim": [{"size": "200"}, {"size": "800"}]}]}}, "_lower_using_switch_merge": {"b": false}, "_read_only_resource_inputs": {"list": {"i": ["8", "9", "10"]}}, "parallel_iterations": {"i": "32"}, "cond": {"func": {"name": "__inference_model_bidirectional_forward_lstm_while_cond_58002_frozen_12010"}}, "_num_original_outputs": {"i": "11"}, "_stateful_parallelism": {"b": false}, "body": {"func": {"name": "__inference_model_bidirectional_forward_lstm_while_body_58003_frozen_12012"}}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/while", "op": "While", "input": ["StatefulPartitionedCall/model/bidirectional/backward_lstm/while/loop_counter", "StatefulPartitionedCall/model/bidirectional/backward_lstm/while/maximum_iterations", "StatefulPartitionedCall/model/bidirectional/backward_lstm/time", "StatefulPartitionedCall/model/bidirectional/backward_lstm/TensorArrayV2_1", "StatefulPartitionedCall/model/bidirectional/backward_lstm/zeros", "StatefulPartitionedCall/model/bidirectional/backward_lstm/zeros_1", "StatefulPartitionedCall/model/bidirectional/backward_lstm/strided_slice_1", "StatefulPartitionedCall/model/bidirectional/backward_lstm/TensorArrayUnstack/TensorListFromTensor", "unknown_8", "unknown_9", "unknown_10"], "attr": {"T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "200"}]}, {"dim": [{"size": "-1"}, {"size": "200"}]}, {}, {}, {"dim": [{"size": "1024"}, {"size": "800"}]}, {"dim": [{"size": "800"}]}, {"dim": [{"size": "200"}, {"size": "800"}]}]}}, "_lower_using_switch_merge": {"b": false}, "_read_only_resource_inputs": {"list": {"i": ["8", "9", "10"]}}, "parallel_iterations": {"i": "32"}, "cond": {"func": {"name": "__inference_model_bidirectional_backward_lstm_while_cond_58301_frozen_12009"}}, "_num_original_outputs": {"i": "11"}, "_stateful_parallelism": {"b": false}, "body": {"func": {"name": "__inference_model_bidirectional_backward_lstm_while_body_58302_frozen_12011"}}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/model/bidirectional/forward_lstm/while:3", "StatefulPartitionedCall/model/bidirectional/forward_lstm/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/model/bidirectional/backward_lstm/while:3", "StatefulPartitionedCall/model/bidirectional/backward_lstm/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/forward_lstm/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/model/bidirectional/forward_lstm/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/model/bidirectional/forward_lstm/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/backward_lstm/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/model/bidirectional/backward_lstm/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/model/bidirectional/backward_lstm/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/ReverseV2", "op": "ReverseV2", "input": ["StatefulPartitionedCall/model/bidirectional/backward_lstm/transpose_1", "StatefulPartitionedCall/model/bidirectional/ReverseV2/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/bidirectional/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model/bidirectional/forward_lstm/transpose_1", "StatefulPartitionedCall/model/bidirectional/ReverseV2", "StatefulPartitionedCall/model/bidirectional/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/dropout_1/dropout/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/dropout_1/dropout/Const", "StatefulPartitionedCall/model/bidirectional/concat"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dropout_1/dropout/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/bidirectional/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dropout_1/dropout/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["StatefulPartitionedCall/model/dropout_1/dropout/Shape"], "attr": {"seed": {"i": "0"}, "T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/dropout_1/dropout/GreaterEqual", "op": "GreaterEqual", "input": ["StatefulPartitionedCall/model/dropout_1/dropout/random_uniform/RandomUniform", "StatefulPartitionedCall/model/dropout_1/dropout/GreaterEqual/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dropout_1/dropout/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/model/dropout_1/dropout/GreaterEqual"], "attr": {"SrcT": {"type": "DT_BOOL"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dropout_1/dropout/Mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/dropout_1/dropout/Mul", "StatefulPartitionedCall/model/dropout_1/dropout/Cast"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/time_distributed/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/dropout_1/dropout/Mul_1", "StatefulPartitionedCall/model/time_distributed/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/time_distributed/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/time_distributed/Reshape", "StatefulPartitionedCall/model/time_distributed/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/time_distributed/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model/time_distributed/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/model/time_distributed/dense/Relu", "StatefulPartitionedCall/model/time_distributed/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dropout_2/dropout/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/dropout_2/dropout/Const", "StatefulPartitionedCall/model/time_distributed/Reshape_1"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dropout_2/dropout/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/time_distributed/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dropout_2/dropout/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["StatefulPartitionedCall/model/dropout_2/dropout/Shape"], "attr": {"seed": {"i": "0"}, "T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/dropout_2/dropout/GreaterEqual", "op": "GreaterEqual", "input": ["StatefulPartitionedCall/model/dropout_2/dropout/random_uniform/RandomUniform", "StatefulPartitionedCall/model/dropout_2/dropout/GreaterEqual/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dropout_2/dropout/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/model/dropout_2/dropout/GreaterEqual"], "attr": {"SrcT": {"type": "DT_BOOL"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dropout_2/dropout/Mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/dropout_2/dropout/Mul", "StatefulPartitionedCall/model/dropout_2/dropout/Cast"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/time_distributed_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/dropout_2/dropout/Mul_1", "StatefulPartitionedCall/model/time_distributed_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/time_distributed_1/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/time_distributed_1/Reshape", "StatefulPartitionedCall/model/time_distributed_1/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/time_distributed_1/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model/time_distributed_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/model/time_distributed_1/dense_1/BiasAdd", "StatefulPartitionedCall/model/time_distributed_1/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/time_distributed_1/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_model_bidirectional_forward_lstm_while_cond_58002_frozen_12010", "inputArg": [{"name": "model_bidirectional_forward_lstm_while_model_bidirectional_forward_lstm_while_loop_counter", "type": "DT_INT32"}, {"name": "model_bidirectional_forward_lstm_while_model_bidirectional_forward_lstm_while_maximum_iterations", "type": "DT_INT32"}, {"name": "model_bidirectional_forward_lstm_while_placeholder", "type": "DT_INT32"}, {"name": "model_bidirectional_forward_lstm_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "model_bidirectional_forward_lstm_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "model_bidirectional_forward_lstm_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "model_bidirectional_forward_lstm_while_less_model_bidirectional_forward_lstm_strided_slice_1", "type": "DT_INT32"}, {"name": "model_bidirectional_forward_lstm_while_model_bidirectional_forward_lstm_while_cond_58002___redundant_placeholder0", "type": "DT_VARIANT"}, {"name": "model_bidirectional_forward_lstm_while_model_bidirectional_forward_lstm_while_cond_58002___redundant_placeholder1", "type": "DT_FLOAT"}, {"name": "model_bidirectional_forward_lstm_while_model_bidirectional_forward_lstm_while_cond_58002___redundant_placeholder2", "type": "DT_FLOAT"}, {"name": "model_bidirectional_forward_lstm_while_model_bidirectional_forward_lstm_while_cond_58002___redundant_placeholder3", "type": "DT_FLOAT"}], "outputArg": [{"name": "model_bidirectional_forward_lstm_while_identity", "type": "DT_BOOL"}]}, "nodeDef": [{"name": "model/bidirectional/forward_lstm/while/Less", "op": "Less", "input": ["model_bidirectional_forward_lstm_while_placeholder", "model_bidirectional_forward_lstm_while_less_model_bidirectional_forward_lstm_strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}], "ret": {"model_bidirectional_forward_lstm_while_identity": "model/bidirectional/forward_lstm/while/Less:z:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "argAttr": {"5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "200"}]}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "200"}]}]}}}}, "7": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}}}, {"signature": {"name": "__inference_model_bidirectional_forward_lstm_while_body_58003_frozen_12012", "inputArg": [{"name": "model_bidirectional_forward_lstm_while_model_bidirectional_forward_lstm_while_loop_counter", "type": "DT_INT32"}, {"name": "model_bidirectional_forward_lstm_while_model_bidirectional_forward_lstm_while_maximum_iterations", "type": "DT_INT32"}, {"name": "model_bidirectional_forward_lstm_while_placeholder", "type": "DT_INT32"}, {"name": "model_bidirectional_forward_lstm_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "model_bidirectional_forward_lstm_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "model_bidirectional_forward_lstm_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "model_bidirectional_forward_lstm_while_model_bidirectional_forward_lstm_strided_slice_1_0", "type": "DT_INT32"}, {"name": "model_bidirectional_forward_lstm_while_tensorarrayv2read_tensorlistgetitem_model_bidirectional_forward_lstm_tensorarrayunstack_tensorlistfromtensor_0", "type": "DT_VARIANT"}, {"name": "model_bidirectional_forward_lstm_while_lstm_cell_1_split_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "model_bidirectional_forward_lstm_while_lstm_cell_1_split_1_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "model_bidirectional_forward_lstm_while_lstm_cell_1_readvariableop_resource_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "model_bidirectional_forward_lstm_while_identity", "type": "DT_INT32"}, {"name": "model_bidirectional_forward_lstm_while_identity_1", "type": "DT_INT32"}, {"name": "model_bidirectional_forward_lstm_while_identity_2", "type": "DT_INT32"}, {"name": "model_bidirectional_forward_lstm_while_identity_3", "type": "DT_VARIANT"}, {"name": "model_bidirectional_forward_lstm_while_identity_4", "type": "DT_FLOAT"}, {"name": "model_bidirectional_forward_lstm_while_identity_5", "type": "DT_FLOAT"}, {"name": "model_bidirectional_forward_lstm_while_model_bidirectional_forward_lstm_strided_slice_1", "type": "DT_INT32"}, {"name": "model_bidirectional_forward_lstm_while_tensorarrayv2read_tensorlistgetitem_model_bidirectional_forward_lstm_tensorarrayunstack_tensorlistfromtensor", "type": "DT_VARIANT"}, {"name": "model_bidirectional_forward_lstm_while_lstm_cell_1_split_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "model_bidirectional_forward_lstm_while_lstm_cell_1_split_1_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "model_bidirectional_forward_lstm_while_lstm_cell_1_readvariableop_resource", "type": "DT_FLOAT"}], "isStateful": true, "controlOutput": ["model/bidirectional/forward_lstm/while/lstm_cell_1/ReadVariableOp", "model/bidirectional/forward_lstm/while/lstm_cell_1/ReadVariableOp_1", "model/bidirectional/forward_lstm/while/lstm_cell_1/ReadVariableOp_2", "model/bidirectional/forward_lstm/while/lstm_cell_1/ReadVariableOp_3", "model/bidirectional/forward_lstm/while/lstm_cell_1/split/ReadVariableOp", "model/bidirectional/forward_lstm/while/lstm_cell_1/split_1/ReadVariableOp"]}, "nodeDef": [{"name": "__inference_model_bidirectional_forward_lstm_while_body_58003_frozen_12012/model/bidirectional/forward_lstm/while/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_model_bidirectional_forward_lstm_while_body_58003_frozen_12012/model/bidirectional/forward_lstm/while/lstm_cell_1/dropout_3/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_model_bidirectional_forward_lstm_while_body_58003_frozen_12012/model/bidirectional/forward_lstm/while/lstm_cell_1/dropout_3/GreaterEqual/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "__inference_model_bidirectional_forward_lstm_while_body_58003_frozen_12012/model/bidirectional/forward_lstm/while/lstm_cell_1/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": 